<a href="https://colab.research.google.com/github/tarunsharma1999/SummertrainingML/blob/master/StartingWithPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
from google.colab import files
uploaded = files.upload()

In [0]:
dataframe=pd.read_csv('com.csv')

#import from URL
dataframe1=pd.read_csv('http://13.234.66.67/summer19/datasets/com.csv')

#Data Structre

In [0]:
dataframe1.info()
dataframe.info()

 **To Print Data**

In [18]:
dataframe

            Name Department      Manager  Salary
0     Robin Hood        NaN          NaN     200
1  Arsene Wenger        Bar   Friar Tuck      50
2     Friar Tuck        Foo   Robin Hood     100
3    Little John        Foo   Robin Hood     100
4  Sam Allardyce        NaN          NaN     250
5  Dimi Berbatov        Foo  Little John      50

In [0]:
#from head
dataframe.head(3)

In [0]:
#particular column
dataframe['Name']

In [21]:
# for selecting rows and columns
dataframe.iloc[0:,[0,3]]

            Name  Salary
0     Robin Hood     200
1  Arsene Wenger      50
2     Friar Tuck     100
3    Little John     100
4  Sam Allardyce     250
5  Dimi Berbatov      50

**Functions**

In [24]:
dataframe['Salary'].max()

250

In [28]:
print(dataframe['Salary'].min())
print(dataframe['Salary'].sum())
print(dataframe['Salary'].mean())

50
750
125.0